var datalist = {
    //首页最上面一张图片
    topimg: "./images/wfy2.jpg",
    //定义搜索框热门数据
    selectdata: ["口罩", "希爱力", "阿胶", "万艾可", "安宫牛黄丸", "定坤丹", "龟龄集", "保法止", "奥泰灵"],

    //定义se3列表数据
    selectlist: [
        {
            title: "家中常备",
            list2: [

                { type: "常备用药", datas: ["感冒发烧", "小儿感冒", "胃痛", "消化不良", "腹泻腹痛", "便秘", "脚气", "痤疮", "手足癣", "皮炎湿疹", "失眠", "上火", "咽炎", "咳嗽", "口腔溃疡", "牙疼", "创可贴", "口罩", "视疲劳", "维生素", "蚊虫叮咬", "避孕药", "避孕套", "抗菌消毒", "偏头痛", "高血压", "祛疤", "晕车", "鼻腔护理"] },
                { type: "商品推荐", datas: ["感冒清热颗粒", "奥泰灵胶囊", "白云山金戈", "保济丸", "定坤丹", "安宫牛黄丸", " 伊可新", " 布洛芬混悬液", "达克宁", "子仲益肾丸", "希爱力", "万艾可", "必利劲", " 息斯敏", " 欧立停", "云南白药牙膏", " 龟龄集", " 可丽蓝", " 早早孕", " 福牌阿胶", "香丹清", "避孕药",] },
                { type: "新品推荐", datas: ["参茸丸", "得每通", "儿童清肺口服液", "蛤蚧定喘胶囊"] },
            ],
            rightimg: ["./images/jz.jpg", "./images/999.jpg"],
        },
        {
            title: "中西药品",
        }
    ]
}

var arr = [];
var o = {};
