var datalist = {
    //首页最上面一张图片
    topimg: "./images/wfy2.jpg",
    //定义搜索框热门数据
    selectdata: ["口罩", "希爱力", "阿胶", "万艾可", "安宫牛黄丸", "定坤丹", "龟龄集", "保法止", "奥泰灵"],

    //定义se3列表数据
    selectlist: [
        {
            title: "家中常备",
            list2: [

                { type: "常备用药", datas: ["感冒发烧", "小儿感冒", "胃痛", "消化不良", "腹泻腹痛", "便秘", "脚气", "痤疮", "手足癣", "皮炎湿疹", "失眠", "上火", "咽炎", "咳嗽", "口腔溃疡", "牙疼", "创可贴", "口罩", "视疲劳", "维生素", "蚊虫叮咬", "避孕药", "避孕套", "抗菌消毒", "偏头痛", "高血压", "祛疤", "晕车", "鼻腔护理"] },
                { type: "商品推荐", datas: ["感冒清热颗粒", "奥泰灵胶囊", "白云山金戈", "保济丸", "定坤丹", "安宫牛黄丸", " 伊可新", " 布洛芬混悬液", "达克宁", "子仲益肾丸", "希爱力", "万艾可", "必利劲", " 息斯敏", " 欧立停", "云南白药牙膏", " 龟龄集", " 可丽蓝", " 早早孕", " 福牌阿胶", "香丹清", "避孕药",] },
                { type: "新品推荐", datas: ["参茸丸", "得每通", "儿童清肺口服液", "蛤蚧定喘胶囊"] },
            ],
            rightimg: ["./images/jz.jpg", "./images/999.jpg"],
        },
        {
            title: "中西药品",
            list2: [
                //  { type: "心脑血管", datas: },
                { type: "心脑血管", datas: ["高血压", "高血脂症", "心脏及冠脉疾病", "中风", "心绞痛", "施慧达", "复方丹参片"], },
                { type: "内分泌疾病", datas: ["Ⅱ型糖尿病", "甲亢/甲减", "肥胖症", "格华止", "格列美脲片", "雅塑"] },
                { type: "肝胆疾病", datas: ["乙肝肝炎", "肝硬化", "脂肪肝", "胆结石", "胆囊炎", "恩替卡韦", "阿德福韦酯"] },
                { type: "骨科疾病", datas: ["痛风", "颈椎病", "骨质疏松", "跌打损伤", "关节炎", "优立通", "奥泰灵"] },
                { type: "呼吸疾病", datas: ["支气管炎", "哮喘", "止咳祛痰", "舒利迭", "信必可", "蛤蚧定喘胶囊"] },
                { type: "皮肤疾病", datas: ["手足癣", "荨麻疹", "皮炎/湿疹", "疤痕/瘢痕", "银屑病 ", "脱发", "白癜风", "痤疮", "疱疹", "保法止"] },
                { type: "胃肠疾病", datas: ["胃炎", "胃溃疡", "便秘", "痔疮", "腹泻腹痛", "消化不良", "达喜", "杜密克"] },
                { type: "泌尿疾病", datas: ["尿路感染", "弥凝", "三金片", "排石颗粒", "普乐安片"] },
                { type: "抗感染", datas: ["免疫增强剂", "抗生素", "肿瘤疾病", "西黄丸", "参灵蓝胶囊"] },
                { type: "精神神经", datas: ["癫痫", "抑郁症", "神经衰弱", "偏头痛", "帕金森", "妥泰", "息宁"] },
                { type: "五官疾病", datas: ["急慢性咽炎", "鼻炎", "口腔溃疡", "牙科疾病", "慢严舒柠"] },
                { type: "眼科疾病", datas: ["白内障", "青光眼", "干眼症", "结膜炎", "角膜炎", "视疲劳"] },
                { type: "营养补益", datas: ["维生素", "补血益气", "补充钙剂", "滋补肝肾"] },
            ],
            rightimg: ["./images/prs.jpg", "./images/zgs.jpg"],
        },
        {
            title: "男士专区",
            list2: [
                /*{ type: "男科疾病", datas: },
                                { type: "运动损伤", datas: },
                                { type: "保健专区", datas: },
                                { type: "成人专区", datas: },*/
                { type: "男科疾病", datas: ["勃起功能障碍", "早泄", "补肾壮阳", "泌尿系统感染", "前列腺炎", "男性脱发", "希爱力", "万艾可", "必利劲", " 肾宝片", "参茸丸", "前列康"] },
                { type: "运动损伤", datas: ["跌打损伤", "骨质疏松", "颈椎病", "扶他林", "颈康胶囊", "颈腰康胶囊", "正红花油", "罗盖全", "云南白药气雾剂"] },
                { type: "保健专区", datas: ["海狗丸", "海王金樽", "知柏地黄丸", "五子衍宗丸", "海狗鞭特补胶囊", "锁阳固精丸", "大补阴丸", "复方玄驹胶囊", "子仲益肾丸", "龟龄集", "海马补肾丸", "防衰益寿丸"] },
                { type: "成人专区", datas: ["杜蕾斯", "名流", "情趣内衣", "震震环", "缩阴球", "飞机杯", "震动棒"] },

            ],
            rightimg: ["./images/bys.jpg", "./images/trt.jpg"],
        },
        {
            title: "女士专区",
            list2: [

                { type: "妇科疾病", datas: ["月经不调", "妇科炎症", "阴道炎", "避孕药", "更年期综合症", "乳腺疾病", "保胎促孕", "爱宝疗", "坤宝丸", "定坤丹", "逍遥丸", "毓婷", "优思明"] },
                { type: "保养专区", datas: ["爱乐维", "排毒养颜胶囊", "琥珀酸亚铁片", "驴胶补血颗粒", "奥利司他胶囊", "碧生源常菁茶", "可丽蓝排卵测试笔", "福牌阿胶", "十全大补丸"] },
                { type: "美妆专区", datas: ["祛痘消印", "疤痕修复", "身体乳/霜", "隔离防晒", "美体塑身"] },
            ],
            rightimg: ["./images/ly.jpg", "./images/lt.jpg"],
        },
        {
            title: "妈妈宝宝",
            list2: [

                { type: "孕产营养", datas: ["叶酸", "孕期维生素", "爱乐维", "玛特纳"] },
                { type: "妈妈用品", datas: ["腹带", "防辐射服", "乳头保护"] },
                { type: "宝宝用品", datas: ["退热贴", "洗发精", "儿童口罩", "儿童体温计", "沐浴露", "婴儿服", "奶瓶餐具", "防撞保护", "奶癣膏", "爽身粉", "浴巾", "润肤露", "纸尿裤", "蚊虫叮咬", "婴幼儿配方奶粉", "儿童玩具"] },
                { type: "儿科用药", datas: ["小儿感冒发烧", "小儿止咳化痰", "小儿胃肠用药", "补锌补钙", "驱虫药", "伊可新"] },
            ],
            rightimg: ["./images/alw.jpg", "./images/ykx.jpg"],
        },
        {
            title: "医疗器械",
            list2: [
                /*{ type: "男科疾病", datas: },
                                { type: "运动损伤", datas: },
                                { type: "保健专区", datas: },
                                { type: "成人专区", datas: },*/
                { type: "血压监测", datas: ["辅助配件", "上臂式血压计", "腕式血压计", "语音式血压计", "水银血压计", "听诊器配件"] },
                { type: "血糖监测", datas: ["血糖监测", "血糖仪套装", "血糖试纸", "血糖仪", "手指消毒", "胰岛素针头", "胰岛素注射器", "采血笔/采血针"] },
                { type: "手术器械", datas: ["冲洗器", "医用剪刀", "止血钳", "灌肠器", "洗耳球", "手术剪刀", "镊子", "吸痰器", "输液器", "注射器", "引流袋", "医用口罩", "医用手套"] },
                { type: "体温检测", datas: ["电子体温计", "水银体温计"] },
                { type: "健康管理", datas: ["体重监测", "体脂监测", "心梗检测", "血氧仪", "尿糖检测", "尿液检测", "心率仪"] },
                { type: "康复护理", datas: ["轮椅/拐杖/助行器", "便器/便椅", "辅助配件", "护垫/床垫"] },
                { type: "保健理疗", datas: ["鼻腔护理", "矫姿/矫形", "周林频谱", "艾灸", "理疗仪器", "雾化器", "制氧机", "理疗贴", "女性护理仪", "消毒灯", "按摩器", "拔罐器", "针灸", "氧气袋", "刮痧板", "听诊器"] },
                { type: "护具系列", datas: ["弹力袜", "护腰/护胸", "护颈/护肩", "护肘/护腕", "护膝/护踝", "矫姿/矫形"] },
            ],
            rightimg: ["./images/he.jpg", "./images/hm.jpg"],
        },
        {
            title: "成人用品",
            list2: [
                /*{ type: "男科疾病", datas: },
                                { type: "运动损伤", datas: },
                                { type: "保健专区", datas: },
                                { type: "成人专区", datas: },*/
                { type: "助情液", datas: ["延时液", "润滑液", "快感增强液", "洁阴液", "按摩油"] },
                { type: "两性玩具", datas: ["震动器", "排珠棒", "夹吸器", "男人玩具", "缩阴仪"] },
                { type: "避孕套", datas: ["天然", "超薄", "颗粒", "螺纹", "多重功效", "热感", "凉感", "果味", "组合套装", "女用", "润滑"] },
                { type: "情趣内衣", datas: ["套装"] },
                { type: "验孕/排卵", datas: ["排卵试纸/盒", "验孕试纸/盒"] },
            ],
            rightimg: ["./images/dls.jpg", "./images/key.jpg"],
        },
        {
            title: "滋补保健",
            list2: [

                { type: "维生素/矿物质", datas: ["维生素A", "维生素B", "维生素C", "维生素D", "维生素E", "复合矿物质", "钙铁锌硒"] },
                { type: "机能改善", datas: ["延缓衰老", "调节三高", "增强免疫力", "抗疲劳", "美容瘦身", "补气养血", "养肝解酒", "润肠排油", "健脑益智", "胃肠保健", "调节肠道菌群"] },
                { type: "营养调节", datas: ["灵芝孢子粉", "西洋参", "阿胶", "蛋白粉", "螺旋藻", "蜂王浆", "蜂胶蜂蜜", "葡萄籽", "辅酶Q10", "褪黑素", "小麦胚芽油", "胡萝卜素", "氨基酸", "大豆异黄酮", "膳食纤维", "胶原蛋白"] },
                { type: "女士保养", datas: ["减肥瘦身", "延缓衰老", "纤体排毒", "滋阴补血", "胶原蛋白"] },
                { type: "男士保健", datas: ["补肾强身", "解酒护肝"] },
                { type: "中老年保健", datas: ["调节三高", "骨骼关节", "改善睡眠", "深海鱼油", "大豆卵磷脂"] },
                { type: "中药饮片", datas: ["胖大海", "决明子", "罗汉果", "枸杞",] },
                { type: "休闲食品", datas: ["休闲零食", "速食冲饮"] },
                { type: "养生花茶", datas: ["茉莉", "蜂蜜", "凉茶"] },
            ],
            rightimg: ["./images/sc.jpg", "./images/tr.jpg"],
        },
        {
            title: "美妆/百货",
            list2: [
                /*{ type: "男科疾病", datas: },
                                { type: "运动损伤", datas: },
                                { type: "保健专区", datas: },
                                { type: "成人专区", datas: },*/
                { type: "面部护理", datas: ["隔离防晒", "洁面卸妆", "面膜眼霜", "美白补水", "祛痘消印", "祛皱保湿", "敏感修复", "干燥瘙痒", "疤痕修复", "乳液面霜", "精华液", "唇膏"] },
                { type: "身体护理", datas: ["身体乳/霜", "足部护理", "手部护理", "美体塑身", "爽肤水", "润肤水", "私处护理"] },
                { type: "口腔护理", datas: ["漱口水", "牙刷", "牙膏", "假牙清洁"] },
                { type: "个人洗护", datas: ["洗发水", "手足霜", "烫发染发", "洗手液", "足浴用品", "沐浴露", "香皂"] },
                { type: "卫生用品", datas: ["卫生纸/抽纸", "便器/便椅", "牙线牙签", "湿纸巾", "手套", "口罩", "防霉防虫", "鞋垫袜子", "成人纸尿裤", "卫生巾", "护垫"] },
                { type: "物品洗涤", datas: ["洗洁精", "洗衣粉", "洗衣皂", "厨房清洁", "卫浴清洁", "消毒液", "衣物护理剂"] },
                { type: "家用电器", datas: ["理发器", "消毒杀菌", "插排插座", "修脚器", "湿度计", "煎药锅"] },
                { type: "精油系列", datas: ["甘油", "精油皂", "按摩油"] },
                { type: "环境卫生", datas: ["熏香", "芳香剂", "空气净化"] },
                { type: "体检卡", datas: ["体检卡"] },
            ],
            rightimg: ["./images/yg.jpg", "./images/bw.jpg"],
        },
    ],

    //定义轮播图图片
    loopImg: ["./images/86vAJm99_L.jpg", "./images/a6EfLKDy_L.jpg", , "./images/I9UL5sOu_L.jpg", , "./images/TByXvpz8_L.jpg", , "./images/xJcJywbz_L.jpg",]

}




// var arr = [];
// var o = {};
// for (var i = 0; i < dd.length; i++) {

//     var acc = Array.from(n4).map(element => {
//         return element.innerHTML;
//     }).join(",");
//     // console.log("[" + `${acc}` + "]")
// }


// Array.from(dd).map(element => {
//     // console.log(element.children);//dd标签  //下面子标签
//     var arr = Array.from(element.children).map(ele => {
//         return `"${ele.innerHTML}"`;
//     }).join(",");
//     console.log("[" + `${arr}` + "]")
// });